{
  "host": "127.0.0.1",
  "port": 50001,

  "graphics_mode": "minotauro",
  "image_directory": "./images/",

  "background_color": "lightgray",
  "step_color": "turquoise",
  "view_color": "red",

  "use_maps?": true,
  "object_dictionary": {
    " ": "free space",
    "O": "visible obstacle",
    "I": "invisible obstacle",
    "B": "bomb",
    "G": "goal",
    "A": "agent start position (only 1)"
  },
  "object_map":[
    "OOOOOOOO",
    "O   O  O",
    "OG  O  O",
    "O I  A O",
    "OOOOOOOO"
  ],
  "weight_dictionary": {
    "1": 1,
    "2": 2,
    "3": 5,
    "4": 10,
    "R": "random"
  },
  "weight_map" : [
    "1111111",
    "1111111",
    "1114411",
    "1111111",
    "1111111"
  ]
}
